[{"Reviewer Name": "Debbie", "Review Title": "Peeling at the top on both sides.I loved the color but, I’m going to try a different case.", "Review Date": "Reviewed in the United States on January 21, 2023", "Review Rating": "5.0 out of 5 stars", "Review Data": "I don’t like that it pulls my hair. It’s sturdy but, it has started peeling on the top on both sides. Expensive cases to mess up like that. I never put in my pocket it is always placed in a purse."}, {"Reviewer Name": "Amazon Customer", "Review Title": "Meets my expectations", "Review Date": "Reviewed in the United States on March 10, 2021", "Review Rating": "5.0 out of 5 stars", "Review Data": "I’ve always opted for the Apple leather case in my past iPhones.  They were good, but the patina from the leather can make the phone look a bit old.  So, I thought I give the silicone case a try.  Overall the fit is 9/10.  It feels a little looser than the leather of previous generations, but it’s good enough and I had no issue with it popping out of the phone.  After 3 months of use, the corners are showing some wear.  The matte finish becomes semi-gloss.  This doesn’t bother me however.  One good thing about silicone case is that it doesn’t slip out of my pocket like the leather one does.  Overall, this case meets my expectations, and I will purchase it again for my future iPhones."}, {"Reviewer Name": "Brandon S.", "Review Title": "Well worth it", "Review Date": "Reviewed in the United States on January 13, 2024", "Review Rating": "5.0 out of 5 stars", "Review Data": "I’ve had dozens of cases throughout the years but this one is probably my favorite. Thin, sleek, comfortable and durable."}, {"Reviewer Name": "Vadym", "Review Title": "Good quality", "Review Date": "Reviewed in the United States on February 8, 2024", "Review Rating": "5.0 out of 5 stars", "Review Data": "Nice touch"}, {"Reviewer Name": "Nancie", "Review Title": "I love this case, it's protected my phone but ...", "Review Date": "Reviewed in the United States on December 17, 2022", "Review Rating": "4.0 out of 5 stars", "Review Data": "This is my second case. I love this case, it's protected my phone, but ... each time the phone is dropped another chunk of silicone breaks or peels off the case. The color is great, the feel is great, not too sticky or slippery, nice feel in my hand, slim. I understand silicone and there is a fine balance between how hard to make it vs look and feel. For me the look and feel of the product when I am carrying it was more important so I bought another one and know it will only last me a year or so."}, {"Reviewer Name": "Diego Quesada", "Review Title": "", "Review Date": "Reviewed in the United States on March 18, 2024", "Review Rating": "5.0 out of 5 stars", "Review Data": "Excelente, como esperado!"}, {"Reviewer Name": "tim cadle", "Review Title": "Great Value For This iPhone Case!", "Review Date": "Reviewed in the United States on October 5, 2023", "Review Rating": "5.0 out of 5 stars", "Review Data": "I was a little hesitant about buying this case considering the price-point, but I figured I’d give it a try after it went on sale.  I am so glad that I did!  The fit is absolutely perfect, the texture is perfect for griping but not being too sticky, and it cleans very easily.  I got white concrete dust all over my hands, and I had to use my phone, so I got that dust all over the case while I was holding it.  It wiped right off with a cloth, none of it stuck to the case, which I thought was very impressive with how sticky that dust can be.  I’ve gotten it on tool handles, and other things where it actually stuck to it.  So definitely good on the ease of cleaning.  Also, if anyone is curious, this case’s silicone material matches the feel of the silicone on the iPad Magic Keyboard Case, and it also perfectly color matches with the black one.  And the magsafe capabilities are awesome!  I would highly recommend this case. 👍🏻"}, {"Reviewer Name": "K. downs", "Review Title": "Extremely disappointed", "Review Date": "Reviewed in the United States on February 27, 2024", "Review Rating": "1.0 out of 5 stars", "Review Data": "In the past I’ve used the Apple leather case, but I have to replace it every year or so.  This time I tried the silicon version thinking it would hold up longer than the leather.  Within a few months after purchase it started peeling on all 4 corners.  Then the other day the whole silicone outer layer started ripping when I took it out of my pocket.  Today is February 27 and I just got this iPhone cover July 23.  Super disappointed in this Apple product.  For $50, it should basically last the lifetime of the iPhone, right??  I’m giving up and going with a cheaper generic at this point. At least when it breaks I don’t have to feel so cheated that way."}, {"Reviewer Name": "Avery Olson", "Review Title": "Pretty good!", "Review Date": "Reviewed in the United States on January 21, 2024", "Review Rating": "4.0 out of 5 stars", "Review Data": "It's a pretty good phone case, but I do have a few tings to mention. I was very disappointed as the magnet on the case isn't very strong. I saw complaints about others cases starting to wear really fast and I don't have very much of that yet (I've had it for a few weeks now) and I hope I don't get any wear anytime soon. Paying 50$ for a name brand phone case is insane so I shouldn't experience wear and tear after a month like others complained of."}, {"Reviewer Name": "Brent Brewer", "Review Title": "LEATHERS BETTER.", "Review Date": "Reviewed in the United States on March 1, 2024", "Review Rating": "5.0 out of 5 stars", "Review Data": "."}]